package cn.itcast.text;

import java.io.BufferedReader;
import java.io.IOException;
import java.io.InputStreamReader;
import java.util.ArrayList;
import java.util.List;

import org.junit.Test;

public class UniversityText {
	
	@Test
	public void test1() throws IOException{
		String[] str1 = {"四川省","四川大学","电子科技大学","西南石油大学","西南财经大学","四川农业大学","西南交通大学","成都理工大学","西华大学","成都中医药大学","四川师范大学","成都信息工程大学","西南科技大学","西南民族大学" ,"西南民族大学",
				"西华师范大学" , "中国民用航空飞行学院" , "四川理工学院" ,"泸州医学院" ,"川北医学院" ,"成都医学院" ,"内江师范学院" ,"四川文理学院" ,"乐山师范学院","四川警察学院","成都体育学院" ,"四川音乐学院" ,"四川民族学院" ,"绵阳师范学院",
				"宜宾学院","攀枝花学院" ,"西昌学院"  ,"成都学院"};
		String[] str2 = {"湖北省","武汉大学","华中科技大学","华中师范大学","武汉理工大学","中国地质大学","华中农业大学","中南财经政法大学","湖北大学","武汉科技大学","湖北中医药大学","武汉体育学院","武汉音乐学院","武汉工程大学","湖北工业大学",
				"湖北美术学院","武汉纺织大学","湖北经济学院","武汉工业学院","湖北警官学院","湖北第二师范学院","华中科技大学文华学院","华中科技大学武昌分校","武汉大学东湖分校","武汉大学珞珈学院","武汉理工大学华夏学院","中国地质大学江城学院",
				"华中师范大学汉口分校","华中师范大学武汉传媒学院","中南财经政法大学武汉学院","华中农业大学楚天学院","中南民族大学工商学院","武汉科技大学中南分校","武汉科技大学城市学院","湖北大学知行学院","江汉大学文理学院","湖北工业大学工程技术学院",
				"湖北工业大学商贸学院","武汉工程大学邮电与信息工程学院","武汉科技学院外经贸学院","湖北经济学院法商学院","武汉体育学院体育科技学院","武汉工业学院工商学院","武汉生物工程学院"};
		/*String str3 = "湖南省,中南大学,湖南大学,湖南师范大学,湘潭大学 ,湖南科技大学,长沙理工大学,南华大学,湖南工程学院 ,湖南工业大学,湖南商学院,衡阳师范学院,湖南文理学院 ,国防科学技术大学,湖南农业大学,长沙医学院,中南林业科技大学"
		+"长沙师范专科学校,湖南铁道职业技术学院,邵阳学院 长沙学院 ,湖南涉外经济学院,湖南商务职业技术学院,湖南科技职业学院,长沙民政职业技术学院 ,长沙通信职业技术学院,湖南交通职业技术学院,张家界航空工业职业技术学院"
		+"湖南科技学院 ,湖南中医药大学,湖南工学院,湖南化工职业技术学院,邵阳医学高等专科学校 ,怀化医学高等专科学校,中南大学湘雅医学院,湖南软件职业学院,湖南第一师范学院,湖南城市学院,湖南工业职业技术学院,湖南信息职业技术学院"
		+"湖南机电职业技术学院 ,湘潭职业技术学院,湖南农业大学东方科技学院,湖南城建职业技术学院,长沙南方职业学院 ,株洲职业技术学院,湖南财政经济学院,湖南工程职业技术学院,长沙商贸旅游职业技术学院 ,娄底职业技术学院"
		+"湖南生物机电职业技术学院,湖南都市职业学院,湘南学院 ,湖南人文科技学院,湖南现代物流职业技术学院,湖南理工学院,吉首大学 ,怀化学院";
		 */
		List<String> strList = new ArrayList<String>();
		strList.add(str1[0]);
		strList.add(str2[0]);
		System.out.print(strList);
		System.out.println(strList.get(0));
		BufferedReader br = new BufferedReader(new InputStreamReader(System.in)); 
		String s = null; 
		System.out.println("Enter your value:"); 
		s = br.readLine(); 
		if("四川省".equals(s)){
			for(int i=1;i<=str1.length-1;i++){
				System.out.println(strList.get(0)+"学校："+str1[i]);
			}
		}
		
		
	}
}
